app/controllers/dashboard_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
   def my_account
      logger.info "session -> user id " + session[:userid].to_s
      @user = Users.find(session[:userid])