app/controllers/user_controller.rb

SELECT * FROM `users` WHERE (username = 'sreenadhtg' and password = 'qwerty') LIMIT 1
INSERT INTO `users` (`username`, `userid`, `password`) VALUES('sreenadhtg', NULL, 'qwerty')
---
  def create
    if request.post? and params[:user]
      @user = Users.new(params[:user])
      valid_user = Users.find(:first,:conditions => ["username = ? and password = ?",@user.username, @user.password])
      if valid_user
        flash[:notice]= 'You are already registered'
        redirect_to  :controller => 'user',:action => 'register'
      else
        if @user.save

SELECT * FROM `users` WHERE (username = 'sreenadh' and password = '123456') LIMIT 1
---
  def login
    logger.info "login"
    if request.post? and params[:user]
      @user = Users.new(params[:user])
      valid_user = Users.find(:first,:conditions => ["username = ? and password = ?",@user.username, @user.password])